Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: When you create a Toaster project using the web interface, you are asked to choose a "Release." In the context of Toaster, the term "Release" refers to a set of layers and a BitBake version the OpenEmbedded build system uses to build something. As shipped, Toaster is pre-configured with releases that correspond to Yocto Project release branches. However, you can modify, delete, and create new releases according to your needs. This section provides some background information on releases.
it_it: Quando si crea un progetto Toaster tramite l'interfaccia web, viene richiesto di scegliere una "Release". Nel contesto di Toaster, il termine "Release" si riferisce a un insieme di layer e a una versione di BitBake utilizzati dal sistema di build OpenEmbedded per la compilazione. Toaster è preconfigurato con release corrispondenti ai branch di rilascio di Yocto Project. Tuttavia, è possibile modificare, eliminare e creare nuove release in base alle proprie esigenze. Questa sezione fornisce alcune informazioni di base sulle release.

source: When you create a local copy of a Git repository, the copy has the same set of branches as the original. This means you can use Git to create a local working area (also called a branch) that tracks a specific development branch from the upstream source Git repository. In other words, you can define your local Git environment to work on any development branch in the repository. To help illustrate, consider the following example Git commands::
it_it: Quando si crea una copia locale di un repository Git, la copia ha lo stesso set di branch dell'originale. Ciò significa che è possibile utilizzare Git per creare un'area di lavoro locale (chiamata anche branch) che tenga traccia di uno specifico branch di sviluppo del repository Git di origine. In altre parole, è possibile configurare il proprio ambiente Git locale per lavorare su qualsiasi branch di sviluppo presente nel repository. Per illustrare meglio il concetto, si considerino i seguenti comandi Git di esempio::

source: When you create a local copy of the Git repository, you also have access to all the tags in the upstream repository. Similar to branches, you can create and check out a local working Git branch based on a tag name. When you do this, you get a snapshot of the Git repository that reflects the state of the files when the change was made associated with that tag. The most common use is to check out a working branch that matches a specific Yocto Project release. Here is an example::
it_it: Quando si crea una copia locale del repository Git, si ha accesso anche a tutti i tag presenti nel repository upstream. Analogamente ai branch, è possibile creare e clonare un branch Git di lavoro locale basato sul nome di un tag. In questo modo, si ottiene un'istantanea del repository Git che riflette lo stato dei file al momento della modifica associata a quel tag. L'utilizzo più comune è quello di effettuare il checkout di un branch di lavoro corrispondente a una specifica release di Yocto Project. Ecco un esempio::

source: When you create a project in Toaster, you will be asked to provide a name and to select a Yocto Project release. One of the release options you will find is called "Local Yocto Project".
it_it: Quando si cra un progetto in Toaster, verrà chiesto di fornire un nome e di selezionare una release di Yocto Project. Una delle opzioni di release che si troverà si chiama "Local Yocto Project".

source: When you launch your build with the ``bitbake target`` command, BitBake sorts out the configurations to ultimately define your build environment. It is important to understand that the :term:`OpenEmbedded Build System` reads the configuration files in a specific order: ``site.conf``, :ref:`structure-build-conf-auto.conf`, and :ref:`structure-build-conf-local.conf`. And, the build system applies the normal assignment statement rules as described in the ":doc:`bitbake:bitbake-user-manual/bitbake-user-manual-metadata`" chapter of the BitBake User Manual. Because the files are parsed in a specific order, variable assignments for the same variable could be affected. For example, if the :ref:`structure-build-conf-auto.conf` file and the ``local.conf`` set variable1 to different values, because the build system parses :ref:`structure-build-conf-local.conf` after :ref:`structure-build-conf-auto.conf`, variable1 is assigned the value from the :ref:`structure-build-conf-local.conf` file.
it_it: Quando si avvia la build col comando ``bitbake target``, BitBake elabora le configurazioni per definire l'ambiente di build. È importante capire che :term:`OpenEmbedded Build System` legge i file di configurazione in un ordine specifico: ``site.conf``, :ref:`structure-build-conf-auto.conf` e :ref:`structure-build-conf-local.conf`. Inoltre, il sistema di build applica le normali regole di assegnazione delle istruzioni come descritto nel capitolo ":doc:`bitbake:bitbake-user-manual/bitbake-user-manual-metadata`" del Manuale Utente di BitBake. Poiché i file vengono analizzati in un ordine specifico, le assegnazioni di variabili per la stessa variabile potrebbero essere influenzate. Ad esempio, se il file :ref:`structure-build-conf-auto.conf` e il file ``local.conf`` assegnano valori diversi alla variabile1, poiché il sistema di compilazione analizza :ref:`structure-build-conf-local.conf` dopo :ref:`structure-build-conf-auto.conf`, alla variabile1 viene assegnato il valore presente nel file :ref:`structure-build-conf-local.conf`.

source: When you name an append file, you can use the "``%``" wildcard character to allow for matching recipe names. For example, suppose you have an append file named as follows::
it_it: Quando si assegna un nome a un file append, è possibile utilizzare il carattere jolly "``%``" per consentire la corrispondenza con i nomi delle ricette. Ad esempio, si supponga di avere un file append denominato come segue::

source: When you perform a build, you can use the "-u" BitBake command-line option to specify a user interface viewer into the dependency graph (e.g. knotty, ncurses, or taskexp) that helps you understand the build dependencies better.
it_it: Quando si esegue una compilazione, è possibile utilizzare l'opzione da riga di comando "-u" di BitBake per specificare un'interfaccia utente di visualizzazione del grafo delle dipendenze (ad es. knotty, ncurses o taskexp), facilitando così la comprensione delle dipendenze di compilazione.

source: When you run the ``bitbake`` command, the main BitBake executable (which resides in the ``bitbake/bin/`` directory) starts. Sourcing the environment setup script (i.e. :ref:`structure-core-script`) places the ``scripts/`` and ``bitbake/bin/`` directories (in that order) into the shell's ``PATH`` environment variable.
it_it: Quando si esegue il comando ``bitbake``, viene avviato l'eseguibile principale di BitBake (che si trova nella directory ``bitbake/bin/``). L'esecuzione dello script di configurazione dell'ambiente (ad esempio, :ref:`structure-core-script`) aggiunge le directory ``scripts/`` e ``bitbake/bin/`` (in quest'ordine) alla variabile d'ambiente ``PATH`` della shell.

source: When you run this script, your Yocto Project environment is set up, a :term:`Build Directory` is created, your working directory becomes the :term:`Build Directory`, and you are presented with some simple suggestions as to what to do next, including a list of some possible targets to build. Here is an example::
it_it: Quando so esegue questo script, l'ambiente di Yocto Project viene configurato, viene creata una :term:`Build Directory`, la directory di lavoro diventa la :term:`Build Directory` e vengono presentati alcuni semplici suggerimenti su cosa fare successivamente, incluso un elenco di possibili target da compilare. Ecco un esempio::

source: When you select the "Local Yocto Project" release, Toaster will run your builds using the local Yocto Project clone you have in your computer: the same clone you are using to run Toaster. Unless you manually update this clone, your builds will always use the same Git revision.
it_it: Quando si seleziona la release "Local Yocto Project", Toaster eseguirà le build utilizzando la copia locale di Yocto Project presente sul proprio computer: la stessa copia che si usa per eseguire Toaster. A meno che non si aggiorni manualmente questa copia, le build utilizzeranno sempre la stessa revisione Git.

source: When you set up a layer for a new BSP, you should follow a standard layout. This layout is described in the ":ref:`bsp-manual/bsp:example filesystem layout`" section. In the standard layout, notice the suggested structure for recipes and configuration information. You can see the standard layout for a BSP by examining any supported BSP found in the :yocto_git:`meta-intel </meta-intel>` layer.
it_it: Quando si configura un layer per un nuovo BSP, è necessario seguire un layout standard. Questo layout è descritto nella sezione ":ref:`bsp-manual/bsp:example filesystem layout`". Nel layout standard, si noti la struttura suggerita per le ricette e le informazioni di configurazione. È possibile visualizzare la struttura standard di un BSP esaminando qualsiasi BSP supportato presente nel layer :yocto_git:`meta-intel </meta-intel>`.

source: When you start Toaster for the first time, or if you delete the file ``toaster.sqlite`` and restart, the database will populate cleanly from this layer index server.
it_it: Quando si avva Toaster per la prima volta, o se si elimina il file ``toaster.sqlite`` e lo si riavvia, il database verrà popolato correttamente da questo server di indice dei layer.

source: When you tie a layer source into Toaster, it can query the layer source through a :wikipedia:`REST <Representational_state_transfer>` API, store the information about the layers in the Toaster database, and then show the information to users. Users are then able to view that information and build layers from Toaster itself without having to clone or edit the BitBake layers configuration file :ref:`structure-build-conf-bblayers.conf`.
it_it: Quando si collega una sorgente di layer a Toaster, quest'ultimo può interrogare la sorgente tramite un'API :wikipedia:`REST <Representational_state_transfer>`, memorizzare le informazioni sui layer nel database di Toaster e quindi mostrare tali informazioni agli utenti. Gli utenti possono quindi visualizzare queste informazioni e creare layer direttamente da Toaster senza dover clonare o modificare il file di configurazione dei layer di BitBake :ref:`structure-build-conf-bblayers.conf`.

source: When you try to build the software, the build system will produce an error and give you the correct string that you can substitute into the recipe file for a subsequent build.
it_it: Quando si tenta di compilare il software, il sistema di build genererà un errore e fornirà la stringa corretta che è possibile sostituire nel file di configurazione per una compilazione successiva.

source: Where To Go Next
it_it: Cosa Fare Ora?

source: Where the ``layers/`` directory corresponds to the directory containing :term:`layers <Layer>` for your project, and the ``build/`` directory corresponds to the :term:`Build Directory`.
it_it: Dove la directory ``layers/`` corrisponde alla directory contenente i :term:`layer <Layer>` del progetto, e la directory ``build/`` corrisponde alla :term:`Build Directory`.

source: Where:
it_it: Dove:

source: While Poky is a "complete" distribution specification and is tested and put through QA, you cannot use it as a product "out of the box" in its current form.
it_it: Sebbene Poky sia una specifica di distribuzione "completa", testata e sottoposta a QA, non è possibile utilizzarla così com'è per un prodotto finale.

source: While each development environment is unique, there are some best practices or methods that help development run smoothly. The following list describes some of these practices. For more information about Git workflows, see the workflow topics in the `Git Community Book <https://book.git-scm.com>`__.
it_it: Sebbene ogni ambiente di sviluppo sia unico, esistono alcune best practice o metodi che contribuiscono a un flusso di lavoro più fluido. L'elenco seguente descrive alcune di queste pratiche. Per ulteriori informazioni sui flussi di lavoro di Git, consultare gli argomenti relativi ai flussi di lavoro nel `Libro su Git della Community <https://book.git-scm.com>`__.

source: While stable releases are supported for a duration of seven months, some specific ones are now supported for a longer period by the Yocto Project, and are called Long Term Support (:term:`LTS`) releases.
it_it: Mentre le versioni stabili sono supportate per una durata di sette mesi, alcune versioni specifiche sono ora supportate per un periodo più lungo da Yocto Project e sono chiamate versioni Long Term Support (:term:`LTS`).

source: While the Yocto Project Team attempts to ensure all Yocto Project releases are one hundred percent compatible with each officially supported Linux distribution, you may still encounter problems that happen only with a specific distribution.
it_it: Sebbene il team di Yocto Project si impegni a garantire la piena compatibilità di tutte le release con ogni distribuzione Linux ufficialmente supportata, è possibile che si verifichino problemi specifici di una determinata distribuzione.

source: While the cadence is never perfect, this timescale facilitates regular releases that have strong QA cycles while not overwhelming users with too many new releases. The cadence is predictable and avoids many major holidays in various geographies.
it_it: Sebbene la cadenza non sia mai perfetta, questa tempistica facilita rilasci regolari con cicli di QA rigorosi, senza sovraccaricare gli utenti con troppi nuovi rilasci. La cadenza di rilascio è prevedibile ed evita molte festività importanti in diverse aree geografiche.

source: While the figure shows several ``recipes-*`` directories, not all these directories appear in all BSP layers.
it_it: Sebbene la figura mostri diverse directory ``recipes-*``, non tutte queste directory compaiono in tutti i livelli BSP.

source: Wikipedia has a good :wikipedia:`historical description of the Open Source Philosophy <Open_source>`. You can also find helpful information on how to participate in the Linux Community `here <https://www.kernel.org/doc/html/latest/process/index.html>`__.
it_it: Wikipedia offre un'ottima :wikipedia:`descrizione storica della Open Source Philosophy <Open_source>`. È inoltre possibile trovare informazioni utili su come partecipare alla Linux Community `qui <https://www.kernel.org/doc/html/latest/process/index.html>`__.

source: Will setup the ``machine`` Built-in Fragment for modifying the value of the :term:`MACHINE` variable.
it_it: Questo codice configura il Built-in Fragment ``machine`` per modificare il valore della variabile :term:`MACHINE`.

source: With :term:`IMAGE_ROOTFS` pointing to the location of the filesystem under construction and the :term:`PACKAGE_INSTALL` variable providing the final list of packages to install, the root file system is created.
it_it: Con :term:`IMAGE_ROOTFS` che punta alla posizione del filesystem in fase di creazione e la variabile :term:`PACKAGE_INSTALL` che fornisce l'elenco finale dei pacchetti da installare, viene creato il filesystem root.

source: With Toaster you can:
it_it: Con Toaster è possibile:

source: With the "read-only-rootfs" feature enabled, any attempt by the target to write to the root filesystem at runtime fails. Consequently, you must make sure that you configure processes and applications that attempt these types of writes do so to directories with write access (e.g. ``/tmp`` or ``/var/run``).
it_it: Con la funzionalità "read-only-rootfs" abilitata, qualsiasi tentativo da parte del sistema target di scrivere sul filesystem di root in fase di esecuzione fallisce. Di conseguenza, è necessario assicurarsi che i processi e le applicazioni che tentano questo tipo di scritture lo facciano su directory con accesso in scrittura (ad esempio ``/tmp`` o ``/var/run``).

source: With the :ref:`ref-fragments-core-yocto-sbom-cve-check` fragment enabled, the :term:`BitBake` build of an image will try to map each compiled software component recipe name and version information to the CVE database and generate reports in the deployment directory (:term:`DEPLOY_DIR_IMAGE`), one of which being: ``tmp/deploy/images/<machine>/<image-name>-<machine>.rootfs.sbom-cve-check.yocto.json``, a report containing:
it_it: Con il frammento :ref:`ref-fragments-core-yocto-sbom-cve-check` abilitato, la build :term:`BitBake` di un'immagine tenterà di mappare il nome della ricetta e le informazioni sulla versione di ciascun componente software compilato al database CVE e genererà report nella directory di distribuzione (:term:`DEPLOY_DIR_IMAGE`), uno dei quali è: ``tmp/deploy/images/<machine>/<image-name>-<machine>.rootfs.sbom-cve-check.yocto.json``, un report contenente:

source: With the ``gpg`` command-line tool, generate a new pair of public and private keys:
it_it: Col tool da riga di comando ``gpg``, genera una nuova coppia di chiavi pubblica e privata:

source: With the additional information, the header of the patch file in OE-core becomes::
it_it: Con queste informazioni aggiuntive, l'header del file patch in OE-core diventa::

source: With this in mind, the steps to submit a change for a stable branch are as follows:
it_it: Tenendo presente questo, i passaggi per inviare una modifica per un branch stabile sono i seguenti:

source: Within any particular ``recipes-*`` category, the layout should match what is found in the :term:`OpenEmbedded-Core (OE-Core)` Git repository. In other words, make sure you place related files in appropriately-related ``recipes-*`` subdirectories specific to the recipe's function, or within a subdirectory containing a set of closely-related recipes. The recipes themselves should follow the general guidelines for recipes found in the ":doc:`/contributor-guide/recipe-style-guide`" in the Yocto Project and OpenEmbedded Contributor Guide.
it_it: All'interno di una specifica categoria ``recipes-*``, il layout deve corrispondere a quello presente nel repository Git :term:`OpenEmbedded-Core (OE-Core)`. In altre parole, si devono posizionare i file correlati in sottocartelle ``recipes-*`` appropriate e specifiche per la funzione della ricetta, oppure all'interno di una sottocartella contenente un insieme di ricette strettamente correlate. Le ricette stesse devono seguire le linee guida generali per le ricette che si trovano nella ":doc:`/contributor-guide/recipe-style-guide`" nella Guida per i Collaboratori di Yocto Project e di OpenEmbedded.

source: Writing a New Recipe
it_it: Scrivere una Nuova Ricetta

source: Writing one of the available tracers into ``current_tracer`` makes the specified tracer the current tracer::
it_it: Scrivendo uno dei tracer disponibili in ``current_tracer``, il tracer specificato diventa il tracer corrente::

source: X86 architecture testing
it_it: Test dell'architettura X86

source: YP Security Team members may resign at any time.
it_it: I membri dell'YP Security Team possono dimettersi in qualsiasi momento.

source: Yocto Project Application Development and Software Development Kits (SDK/eSDK) Manual
it_it: Manuale di Sviluppo di Applicazioni Yocto Project e Software Development Kit (SDK/eSDK)

source: Yocto Project Board Support Package (BSP) Manual
it_it: Manuale del Board Support Package (BSP) di Yocto Project

source: Yocto Project Components
it_it: Componenti di Yocto Project

source: Yocto Project Concepts
it_it: Concetti di Yocto Project

source: Yocto Project Development Tasks Manual
it_it: Manuale di Sviluppo dei Task di Yocto Project

source: Yocto Project Linux Kernel Development Manual
it_it: Manuale di Sviluppo del Kernel Linux di Yocto Project

source: Yocto Project Overview and Concepts Manual
it_it: Manuale Introduttivo e Concetti di Yocto Project

source: Yocto Project Profiling and Tracing Manual
it_it: Manuale di Profilazione e Tracing di Yocto Project

source: Yocto Project Quick Build
it_it: Build Rapida di un'Immagine con lo Yocto Project

source: Yocto Project Releases and the Stable Release Process
it_it: Rilasci di Yocto Project e Iter dei Rilasci Stabili

source: Yocto Project Security Manual
it_it: Manuale di Sicurezza di Yocto Project

source: Yocto Project Security Reference
it_it: Riferimento di Yocto Project Security

source: Yocto Project Source Repositories
it_it: I Repository del Codice Sorgente di Yocto Project

source: Yocto Project Supported Architectures And Features
it_it: Architetture e Funzionalità Supportate da Yocto Project

source: Yocto Project Terms
it_it: Terminologia di Yocto Project

source: Yocto Project Test Environment Manual
it_it: Manuale dell'Ambiente di Test di Yocto Project

source: Yocto Project and OpenEmbedded Contributor Guide
it_it: Guida per i Collaboratori di Yocto Project e di OpenEmbedded

source: Yocto Project bundles a number of tracing and profiling tools --- this manual describes their basic usage and shows by example how to make use of them to analyze application and system behavior.
it_it: Yocto Project include una serie di strumenti di tracing [tracciamento] e profilazione: questo manuale ne descrive l'utilizzo di base e mostra, tramite esempi, come impiegarli per analizzare il comportamento di applicazioni e sistemi.

source: Yocto Project releases are tested against the stable Linux distributions in the above list. The Yocto Project should work on other distributions but validation is not performed against them.
it_it: Le release di Yocto Project vengono testate sulle distribuzioni Linux stabili elencate sopra. Yocto Project dovrebbe funzionare anche su altre distribuzioni, ma non vengono eseguite validazioni su di esse.

source: You also need to ensure you have the ``en_US.UTF-8`` locale enabled::
it_it: È inoltre necessario assicurarsi che sia abilitata la localizzazione ``en_US.UTF-8``::

source: You can add product specifications that can customize the distribution if needed in other layers. You can also add other functionality specific to the product. But to update the distribution, not individual products, you update the distribution feature through that layer.
it_it: È possibile aggiungere specifiche di prodotto che personalizzano la distribuzione, se necessario, in altri layer. È inoltre possibile aggiungere altre funzionalità specifiche per il prodotto. Tuttavia, per aggiornare la distribuzione, e non i singoli prodotti, è necessario aggiornare la funzionalità di distribuzione tramite il layer corrispondente.

source: You can browse the source of :term:`OpenEmbedded-Core (OE-Core)` at :oe_git:`openembedded-core </openembedded-core>`.
it_it: È possibile consultare il codice sorgente di :term:`OpenEmbedded-Core (OE-Core)` su :oe_git:`openembedded-core </openembedded-core>`.

source: You can create a local copy of any repository by "cloning" it with the ``git clone`` command. When you clone a Git repository, you end up with an identical copy of the repository on your development system. Once you have a local copy of a repository, you can take steps to develop locally.
it_it: È possibile creare una copia locale di qualsiasi repository "clonandolo" con il comando ``git clone``. Quando si clona un repository Git, si ottiene una copia identica del repository sul proprio sistema di sviluppo. Una volta ottenuta una copia locale di un repository, è possibile procedere con lo sviluppo in locale.

source: You can detach from the service again using "Ctrl-a" followed by "d" key combination.
it_it: Vi si può disconnettere dal servizio utilizzando la combinazione di tasti "Ctrl-a" seguita da "d".
